app/Http/Controllers/AdminDashboardController.php

    public function index()
    {
        $loanSchedulesAll = LoanSchedule::with('rooms')->get();
        $loanSchedulesCurrent = LoanSchedule::with('rooms')
            ->where('status', 'In Progress')
            ->orderBy('loan_date', 'desc')
            ->get();
        $today = Carbon::today()->toDateString();
        $todayLoan = LoanSchedule::with('rooms')->where('loan_date', $today)->get();
---
SELECT * FROM `loan_schedules`
SELECT * FROM `loan_schedules` WHERE `status_id` = 1 ORDER BY `loan_date` DESC
SELECT * FROM `rooms` WHERE `rooms`.`id` in (1, 6, 7, 8, 12)