app/Http/Controllers/BuildingController.php

    public function index()
    {
        $buildings = Building::all();
---
SELECT * FROM `buildings`

    public function showAdmin()
    {
        $buildings = Building::all();
        $loan_schedules = LoanSchedule::orderBy('loan_date', 'desc')->get();
---
SELECT * FROM `loan_schedules` ORDER BY `loan_date` DESC