app/Http/Controllers/LoanScheduleController.php

SELECT * FROM `rooms`
SELECT * FROM `buildings`
---
    public function create()
    {
        $user = Auth::user();
        $rooms = Room::all();
        $buildings = Building::all();

SELECT * FROM `loan_schedules` WHERE `loan_schedules`.`id` = '24' LIMIT 1
SELECT * FROM `rooms` WHERE `rooms`.`id` in (1)
SELECT * FROM `buildings` WHERE `buildings`.`id` in (1)
SELECT * FROM `facilities` WHERE `facilities`.`id` in (2)
SELECT * FROM `rooms` WHERE `building_id` = 1 LIMIT 1
SELECT * FROM `loan_schedules` WHERE `room_id` = 1 ORDER BY `loan_date` DESC
---
    public function show($id)
    {
        $detailRoomLoan = LoanSchedule::with('rooms')->find($id);
        // dd($detailRoomLoan);
        $roomBuilding = Room::with('buildings', 'facilities')->find($detailRoomLoan->rooms->building_id);
        // dd($roomBuilding);

        //time
        $time['start'] = Carbon::createFromFormat('H:i:s', $detailRoomLoan->start_time);
        $time['end'] = Carbon::createFromFormat('H:i:s', $detailRoomLoan->end_time);
        $time['start'] = $time['start']->format('H:i');
        $time['end'] = $time['end']->format('H:i');

        $allRooms = LoanSchedule::with('user')->where('room_id', $detailRoomLoan->room_id)->orderBy('loan_date', 'desc')->get();

SELECT * FROM `users` WHERE `users`.`nim` in ('2208561001')
SELECT * FROM `rooms` WHERE `rooms`.`id` in (1, 6, 7, 8, 12)
---
    public function history()
    {
        $idUser = Auth()->user()->nim;
        $loanSchedules = LoanSchedule::with('rooms')->where('user_nim', $idUser)->get();

SELECT * FROM `loan_schedules` WHERE not `status_id` = 1 ORDER BY `loan_date` DESC
SELECT * FROM `rooms` WHERE `rooms`.`id` in (1, 6, 7, 8, 12)
---
    public function showAdmin()
    {
        $loanSchedulesAdvice = LoanSchedule::with('rooms')->where('status', 'In Progress')->orderBy('loan_date', 'desc')->get();

SELECT * FROM `loan_schedules` WHERE `loan_schedules`.`id` = '24' LIMIT 1
SELECT * FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT * FROM `buildings` WHERE `buildings`.`id` in (1)
SELECT * FROM `facilities` WHERE `facilities`.`id` in (2)
SELECT * FROM `rooms` WHERE `building_id` = 1 LIMIT 1
SELECT * FROM `loan_schedules` WHERE `room_id` = 1 ORDER BY `loan_date` DESC
SELECT * FROM `rooms` WHERE `rooms`.`id` in (1)
---
    public function detailAdmin($id)
    {
        $detailRoomLoan = LoanSchedule::with('rooms', 'user')->find($id);
        // dd($detailRoomLoan);
        $roomBuilding = Room::with('buildings', 'facilities')->find($detailRoomLoan->rooms->building_id);
        // dd($roomBuilding);

        //time
        $time['start'] = Carbon::createFromFormat('H:i:s', $detailRoomLoan->start_time);
        $time['end'] = Carbon::createFromFormat('H:i:s', $detailRoomLoan->end_time);
        $time['start'] = $time['start']->format('H:i');
        $time['end'] = $time['end']->format('H:i');

        $allRooms = LoanSchedule::with('user')->where('room_id', $detailRoomLoan->room_id)->orderBy('loan_date', 'desc')->get();